START_FIRST_PAGE = True

chrome_headless = False

force_updateDB = True

google_photo_delete_days = 30

sheet_url = 'https://docs.google.com/spreadsheets/d/1-f2TtOCYPcGMxLmu-cdKTzHMujipPlNsrY-ivexAaeU/edit?usp=sharing'

#thaiprovince,utf8,pageGoogleSheet
search_province = {
    'nonthaburi' : ['นนทบุรี','%B9%B9%B7%BA%D8%C3%D5',1],
    'nakhonpathom' : ['นครปฐม','%B9%A4%C3%BB%B0%C1',2],
    'samutsakorn' :['สมุทรสาคร','%CA%C1%D8%B7%C3%CA%D2%A4%C3',3],
    'chonburi' : ['ชลบุรี','%AA%C5%BA%D8%C3%D5',4],
    'songkhla' : ['สงขลา','%CA%A7%A2%C5%D2',5],
    'nokhonnayok' : ['นครนายก','%B9%A4%C3%B9%D2%C2%A1',6],
    'ratchaburi' : ['ราชบุรี','%C3%D2%AA%BA%D8%C3%D5',7],
    'bangkok' : ['กรุงเทพมหานคร','%A1%C3%D8%A7%E0%B7%BE%C1%CB%D2%B9%A4%C3',8],
    'phuket' : ['ภูเก็ต','%C0%D9%E0%A1%E7%B5',9],
    'chiangmai' : ['เชียงใหม่','%E0%AA%D5%C2%A7%E3%CB%C1%E8',10],
    'lampang' : ['ลำปาง','%C5%D3%BB%D2%A7',11],
    'lumphun' : ['ลำพูน','%C5%D3%BE%D9%B9',12],
    'pathumthani' : ['ปทุมธานี','%BB%B7%D8%C1%B8%D2%B9%D5',13],
    'lopburi' : ['ลพบุรี','%C5%BE%BA%D8%C3%D5',14]



}

dict_province = {0: 'กรุงเทพมหานคร', 1: 'กระบี่', 2: 'กาญจนบุรี', 3: 'กาฬสินธุ์', 4: 'กำแพงเพชร', 5: 'ขอนแก่น', 6: 'จันทบุรี', 7: 'ฉะเชิงเทรา', 8: 'ชลบุรี', 9: 'ชัยนาท', 
10: 'ชัยภูมิ', 11: 'ชุมพร', 12: 'ตรัง', 13: 'ตราด', 14: 'ตาก', 15: 'นครนายก', 16: 'นครปฐม', 17: 'นครพนม', 18: 'นครราชสีมา', 19: 'นครศรีธรรมราช', 
20: 'นครสวรรค์', 21: 'นนทบุรี', 22: 'นราธิวาส', 23: 'น่าน', 24: 'บึงกาฬ', 25: 'บุรีรัมย์', 26: 'ปทุมธานี', 27: 'ประจวบคีรีขันธ์', 28: 'ปราจีนบุรี', 29: 'ปัตตานี', 
30: 'พระนครศรีอยุธยา', 31: 'พะเยา', 32: 'พังงา', 33: 'พัทลุง', 34: 'พิจิตร', 35: 'พิษณุโลก', 36: 'ภูเก็ต', 37: 'มหาสารคาม', 38: 'มุกดาหาร', 39: 'ยะลา', 
40: 'ยโสธร', 41: 'ระนอง', 42: 'ระยอง', 43: 'ราชบุรี', 44: 'ร้อยเอ็ด', 45: 'ลพบุรี', 46: 'ลำปาง', 47: 'ลำพูน', 48: 'ศรีสะเกษ', 49: 'สกลนคร', 
50: 'สงขลา', 51: 'สตูล', 52: 'สมุทรปราการ', 53: 'สมุทรสงคราม', 54: 'สมุทรสาคร', 55: 'สระบุรี', 56: 'สระแก้ว', 57: 'สิงห์บุรี', 58: 'สุพรรณบุรี', 59: 'สุราษฎร์ธานี', 
60: 'สุรินทร์', 61: 'สุโขทัย', 62: 'หนองคาย', 63: 'หนองบัวลำภู', 64: 'อำนาจเจริญ', 65: 'อุดรธานี', 66: 'อุตรดิตถ์', 67: 'อุทัยธานี', 68: 'อุบลราชธานี', 69: 'อ่างทอง', 
70: 'เชียงราย', 71: 'เชียงใหม่', 72: 'เพชรบุรี', 73: 'เพชรบูรณ์', 74: 'เลย', 75: 'แพร่', 76: 'แม่ฮ่องสอน'}

chrome_version = '114.0.5735.90'  #'114.0.5735.90'   #111.0.5563.64'  #'110.0.5481.77'


def index_province(p):
    # p = 'ascaหนองคายvwevw'
    province = [x for x in list(dict_province.values()) if x in p]
    if province:
        index_province = [list(dict_province.values()).index(province[0])][0]
        return index_province
    else:
        return -1


